from gc import collect

q=["%","+","Ã¤","Ã¶","Ã¼","Ã„","Ã–","Ãœ",
   "ÃŸ"," ","Â°","!","\"","Â§","$",
   "&","/","?","\\","^","|","(",")",";",
   ":","#","'","[","]","{","}",
    ]
z=["%25","%2B","%C3%A4","%C3%B6","%C3%BC","%C3%84","%C3%96","%C3%9C",
   "%C3%9F","%20","%C2%B0","%21","%22","%C2%A7","%24",
   "%26","%2F","%3f","%5C","%5E","%7C","%28","%29","%3B",
   "%3A","%23","%27","%5B","%5D","%7B","%7d",
   ]

def url_encode(string):
    for i in range(len(q)):
        if q[i] in string:
            string=string.replace(q[i],z[i])
        collect()
    return string